КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул2/КонтурЛогистика_ТрН_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ТрН_Титул2</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЭТРН</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительСтрока</name>
    <comment>kl-driver из customData</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтметкиПеревозчика</name>
    <comment>есть ли в титуле элемент ОтметПрвПрием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЗамечанияПеревозчика</name>
    <comment>есть ли в титуле элемент ЗамПрвПрием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфПрвПрием</name>
    <comment>Дата формирования файла обмена информации перевозчика о приеме груза к перевозке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфПрвПрием</name>
    <comment>Время формирования файла обмена информации перевозчика о приеме груза к перевозке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфГО</name>
    <comment>Дата формирования файла обмена информации грузоотправителя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфГО</name>
    <comment>Время формирования файла обмена информации грузоотправителя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфГО</name>
    <comment>Идентификатор файла обмена информации грузоотправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомИспрГО</name>
    <comment>Номер исправоления титула 1</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспрГО</name>
    <comment>Дата исправления титула 1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПГО</name>
    <comment>Электронная подпись файла обмена информации грузоотправителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатПодп</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрПриб</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрУбыт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрПосПрием</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамСостГруз</name>
    <comment>Оговорки и замечания в отношении фактического состояния груза, креплении груза, тары, упаковки, маркировки и опломбирования</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамМасс</name>
    <comment>Оговорки и замечания в отношении фактического состояния груза, креплении груза, тары, упаковки, маркировки и опломбирования¶Оговорки и замечания в отношении массы груза</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамКолМест</name>
    <comment>Оговорки и замечания в отношении количества грузовых мест</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамПогрРаб</name>
    <comment>Оговорки и замечания в отношении проведения погрузочных работ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОбОтказеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиПеревозчика</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтмАктВзв</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктИдДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДопСведДок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтороныСоставители</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйСоставитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрафы</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактКолЕдИзм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогРазмШтрРФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчШтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтметкиИнфПол</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамечанияИнфПол</name>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыОсобенностейДокументооборота/КонтурЛогистика_ТипыОсобенностейДокументооборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыОсобенностейДокументооборота</name>
  <enumValues>
    <name>ОбработатьИсправлениеТитула1</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьИсправлениеТитула3</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьИсправленияТитулов13</name>
  </enumValues>
  <enumValues>
    <name>Шаблон</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул2/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновитьДанныеФормы();
	
	Элементы.ДокументОснование.Доступность = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ТипыДокументаОснованияНастроеныДляТитула(2);
	
	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("Группа2");
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаПодписьПеревозчика");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.ЕстьЗамечанияПеревозчика.РастягиватьПоГоризонтали = Истина;
		Элементы.ЕстьЗамечанияПеревозчика.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// ОбновитьДанныеФормы();
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли  ИмяСобытия = "ЗавершениеФоновогоЗадания" 
			И Параметр <> Неопределено
			И ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("КлючФЗ")
			И Параметр.КлючФЗ = "ВыполнениеОбменаКолбаса" Тогда
			
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
			
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
				
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "ПерезаполнитьТитул"
		И Параметр <> Неопределено
		И Параметр = Объект.Ссылка Тогда
		
		ПерезаполнитьПоДокОснованиюСервер();
		ОбновитьДанныеФормы();
		ОбновитьОтображениеДанных();
		ПроверитьДокумент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументЭТРН, Истина);
	ТекущийСтатусОсобенностиДокументооборота = РегистрыСведений.КонтурЛогистика_ОсобенностиДокументооборота.ПолучитьОсобенность(Объект.ДокументЭТРН);
	КрайнийФайл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(Объект.Ссылка);
	ЭтоЭкспедиция = Объект.ДокументЭТРН.ЭтоЭкспедиция;
	
	Если ЗначениеЗаполнено(ТекущийСтатусОсобенностиДокументооборота) 
		И ТекущийСтатусОсобенностиДокументооборота = Перечисления.КонтурЛогистика_ТипыОсобенностейДокументооборота.ОбработатьИсправлениеТитула1
		И Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.ТекущийСтатусОсобенностиДокументооборота.Высота = 3;			
	КонецЕсли;
	
	Если ТекущийСтатусДокументооборота = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НайтиСостояниеДОПоКоду("r-wait-carrier-sign") Тогда 
		ВодительУжеСогласовал = Истина;
	ИначеЕсли ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		ВодительУжеСогласовал = Истина;
	Иначе
		ВодительУжеСогласовал = Ложь;
	КонецЕсли;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2, Объект.ДокументОснование);
		
	ПредусмотренДокументОснование = ЗначениеЗаполнено(НастройкаКонвертации) И ЗначениеЗаполнено(НастройкаКонвертации.ТипДокумента1С);
	Элементы.ГруппаДокументОснование.Видимость = ПредусмотренДокументОснование;
	
	Если Не ЗначениеЗаполнено(ТекущийСтатусОсобенностиДокументооборота) Тогда
		Элементы.ТекущийСтатусОсобенностиДокументооборота.Видимость = Ложь;
	КонецЕсли;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Повторно подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование ,Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка
		ИЛИ (ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен И Справочники.КонтурЛогистика_ФайлыОбмена.ЭтоВходящийНеподписанный(КрайнийФайл))
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена Тогда 
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
		ТолькоПросмотр = Ложь;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УстановитьДоступностьКоманд(Не ТолькоПросмотр);
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	Элементы.ГруппаПричиныОтказаВПодписи.Видимость = ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи); 
	// Причину спрашиваем при нажатии на отказ. 
	// А показываем только если она записана в титул (мы ГО или хотим посмотреть какую причину мы отправили)
	
	Титул1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, Объект.ДокументЭТРН);
	ЗаполинтьДатыПогрузки();
	ЭкспедицияЗаказчик 		= Объект.ДокументЭТРН.ЭкспедицияЗаказчик;
	ПогрузкаСотрудник 		= Объект.ДокументЭТРН.ПогрузкаСотрудник;
	ПогрузкаДоговор 		= Объект.ДокументЭТРН.ПогрузкаДоговор;
	ПогрузкуОсуществляет	= Объект.ДокументЭТРН.ПогрузкуОсуществляет;
	ЕстьСпецРазрешенияТ1	= Титул1.СпецУслДвиж.Количество() > 0;	
	ЕстьОтметкиГО			= Титул1.ОтметкиГрузоотправителя.Количество() > 0;	
	ЕстьДопПоляГО			= ЗначениеЗаполнено(Титул1.СостояниеКузова)
						  ИЛИ ЗначениеЗаполнено(Титул1.СостояниеТары)	
						  ИЛИ ЗначениеЗаполнено(Титул1.СостояниеУпаковки)	
						  ИЛИ ЗначениеЗаполнено(Титул1.СведенияОПломбах)	
						  ИЛИ ЗначениеЗаполнено(Титул1.ТемператураНеНиже)	
						  ИЛИ ЗначениеЗаполнено(Титул1.ТемператураНеВыше)	
						  ИЛИ ЗначениеЗаполнено(Титул1.ВлажностьНеНиже)	
						  ИЛИ ЗначениеЗаполнено(Титул1.ВлажностьНеВыше)	
						  ИЛИ (ЗначениеЗаполнено(Титул1.УказанияВОтношенииНормПеревозки) И СокрЛП(Титул1.УказанияВОтношенииНормПеревозки) <> "Отсутствуют")	
						  ИЛИ ЗначениеЗаполнено(Титул1.ОграничениеСкорости);	
	
	Титул1Водитель = Титул1.Водитель;
		
	ЕстьПрицеп2 = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп2);
	ЕстьПрицеп = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп);
	Грузоотправитель = Объект.ДокументЭТРН.Грузоотправитель;
	
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи.Видимость = Не ТолькоПросмотр;
	КонецЕсли;
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКоманд(Доступность)
	
	УстановитьДоступностьЭлемента("ФормаЗаписать", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СформироватьФайлыОбмена", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителю", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПропуститьДокумент", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОбработатьВходящийДокумент", Доступность);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлемента(ИмяЭлемента, Доступность)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент.Доступность = Доступность;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьЗаголовкиКоличества(Форма)
	
	КоличествоСтрок = 0;
	
	Для Каждого ТекущаяСтрока Из Форма.Титул1.Товары Цикл
		
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоСтрок = КоличествоСтрок + 1;
		
	КонецЦикла;
	
	Форма.Элементы.ГруппаТоварыИзТ1.Заголовок = "Грузы (" + КоличествоСтрок + ")";

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьЧерезНастройкиКонвертации();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЭтоВходящий = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	ЭтоИсправлениеОшибки = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка");
		
	Элементы.ГруппаОтметкиНадпись.Видимость = ЭтоВходящий ИЛИ Не ЭтоЧерновик;
	Элементы.ГруппаОтметкиТумблер.Видимость = ЭтоЧерновик ИЛИ ЭтоИсправлениеОшибки;
	
	Элементы.ГруппаЗамечанияПеревозчика.Видимость = Объект.ЕстьЗамечанияПеревозчика;
	Элементы.ГруппаОтметкиПеревозчика.Видимость = Объект.ЕстьОтметкиПеревозчика;
	Элементы.ГруппаАкты.Видимость 				= Объект.ЕстьОтметкиПеревозчика;
	Элементы.ГруппаШтрафы.Видимость 			= Объект.ЕстьОтметкиПеревозчика;
	Элементы.ГруппаПрицеп2.Видимость			= ЕстьПрицеп2;
	Элементы.ГруппаПрицеп.Видимость				= ЕстьПрицеп;

	Элементы.ВодительСтрока.Видимость 		= ЗначениеЗаполнено(Объект.ВодительСтрока);
	Элементы.ЗамечанияВодителя.Видимость 	= ЗначениеЗаполнено(Объект.ЗамечанияВодителя);
	
	Элементы.НадписьНеСогласовал.Видимость  = Не ВодительУжеСогласовал;
	
	Если ЗначениеЗаполнено(Объект.ЗамечанияВодителя) Тогда
		Элементы.НадписьБезЗамечаний.Видимость 	= Ложь;
	Иначе
		Если ВодительУжеСогласовал Тогда 
			Элементы.НадписьБезЗамечаний.Видимость 	= Истина;
		Иначе
			Элементы.НадписьБезЗамечаний.Видимость 	= Ложь;
		КонецЕсли;
	КонецЕсли;

	Элементы.ГруппаПодписьПеревозчика.Видимость = ЗначениеЗаполнено(Объект.Фамилия);
	
	Элементы.ГруппаЭкспедиция.Видимость = ЭтоЭкспедиция;

	Элементы.ДокументЭТРНПогрузкуОсуществляет.Видимость = ЗначениеЗаполнено(ПогрузкуОсуществляет) И ПогрузкуОсуществляет <> Грузоотправитель;
	Элементы.ДокументЭТРНПогрузкаДоговор.Видимость 		= ЗначениеЗаполнено(ПогрузкаДоговор);
	Элементы.ДокументЭТРНПогрузкаСотрудник.Видимость 	= ЗначениеЗаполнено(ПогрузкаСотрудник);
	
	Элементы.СтраницаСпецУсловияДвижения.Видимость 	= ЕстьСпецРазрешенияТ1;
	Элементы.СтраницаОтметкиГО.Видимость 			= ЕстьОтметкиГО;
	Элементы.СтраницаДопРеквизитыТ1.Видимость 		= ЕстьДопПоляГО;
	
	Элементы.ГруппаПричинаОтказаВПодписи.Видимость = (ЭтоВходящий Или Не ЭтоЧерновик) И Объект.ЕстьОтказВПодписи;
	
	Элементы.ГруппаИсправление.Видимость = Объект.НомИспрГО > 0;
	
	УстановитьЗаголовкиГруппамДопПолей();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.Титул1Водитель.РастягиватьПоГоризонтали = Ложь;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью();
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ТрН_Титул2.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции


// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиДобавить(Команда)
	
	НоваяСтрока = Объект.ОтметкиПеревозчика.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);	
	НоваяСтрока.ДатаИВремяОтметки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ТекущийМоментВремени();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиСкопировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ОтметкиПеревозчикаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Элементы.Акты.ОтборСтрок 			= Неопределено;
		Элементы.Штрафы.ОтборСтрок 			= Неопределено;
		Элементы.ОтметкиИнфПол.ОтборСтрок 			= Неопределено;
		
	Иначе
		
		Элементы.Акты.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		Элементы.Штрафы.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		Элементы.ОтметкиИнфПол.ОтборСтрок 	= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура АктыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.ОтметкиПеревозчика.ТекущиеДанные = Неопределено Тогда 
		
		Отказ = Истина;
		Сообщить("Сначала добавьте Отметку, к которой будет относиться акт");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиИнфПолПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.ОтметкиПеревозчика.ТекущиеДанные = Неопределено Тогда 
		
		Отказ = Истина;
		Сообщить("Сначала добавьте Отметку, к которой будет относиться инфополе");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.ОтметкиПеревозчика.ТекущиеДанные = Неопределено Тогда 
		
		Отказ = Истина;
		Сообщить("Сначала добавьте Отметку, к которой будет относиться штраф");
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура АктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		
		ТекОтметка = Элементы.ОтметкиПеревозчика.ТекущиеДанные;
		
		Если ТекОтметка <> Неопределено Тогда 
			
			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметка.ИдентификаторСтроки;
			Элемент.ТекущиеДанные.АктДата = ТекущаяДата();
			Элемент.ТекущиеДанные.АктНаименование = "Акт";
			
		КонецЕсли
		
	КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ШтрафыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		
		ТекОтметкаГП = Элементы.ОтметкиПеревозчика.ТекущиеДанные;
		
		Если ТекОтметкаГП <> Неопределено Тогда 
			
			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметкаГП.ИдентификаторСтроки;
			
		КонецЕсли
		
	КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ОтметкиПеревозчикаПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.ОтметкиПеревозчика.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	нСтроки = Объект.Акты.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", ТекДанные.ИдентификаторСтроки));
	Для каждого Строка Из нСтроки Цикл
		Объект.Акты.Удалить(Строка);
	КонецЦикла;
	
	нСтроки = Объект.Штрафы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", ТекДанные.ИдентификаторСтроки));
	Для каждого Строка Из нСтроки Цикл
		Объект.Штрафы.Удалить(Строка);
	КонецЦикла;
	
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПеревозчикаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПеревозчикаПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура АктыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура АктыПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтказаВПодписиПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиИнфПолПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		
		ТекОтметка = Элементы.ОтметкиПеревозчика.ТекущиеДанные;
		
		Если ТекОтметка <> Неопределено Тогда 
			
			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметка.ИдентификаторСтроки;
			
		КонецЕсли
		
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗамечанияИнфПолПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПроверитьДокумент();
	УстановитьЗаголовкиГруппамДопПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамечанияИнфПолПослеУдаления(Элемент)
	ПроверитьДокумент();
	УстановитьЗаголовкиГруппамДопПолей();
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиИнфПолПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиИнфПолПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
	УстановитьЗаголовкиГруппамДопПолей();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиГруппамДопПолей()
	
	// ГруппаИнфПоля
	Элементы.ГруппаИнфПол.Заголовок = "Информационные поля (" + Объект.ИнфПол.Количество() + ")";
	Элементы.ГруппаЗамечанияИнфополя.Заголовок = "Информационные поля к замечаниям (" + Объект.ЗамечанияИнфПол.Количество() + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПослеУдаления(Элемент)
	ПроверитьДокумент();
	УстановитьЗаголовкиГруппамДопПолей();
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьЗамечанияПеревозчика1ПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьОтметкиПеревозчика1ПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамДатВрПрибПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамДатВрПосПриемПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ЗамДатВрУбытПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ЗамСостГрузПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ЗамМассПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ЗамКолМестПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ЗамПогрРабПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСтатусОсобенностиДокументооборотаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не Модифицированность Тогда
		Закрыть();
	КонецЕсли;
	
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2");
	ПредыдущийТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1"),
		Объект.ДокументЭТРН);
	ДопПараметрыДействия = Новый Структура;
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(
		ТипЛогистика, ПредыдущийТитул, ЭтаФорма, ДопПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполинтьДатыПогрузки()
	
	Если Не ЗначениеЗаполнено(Титул1) Тогда
		Возврат;
	КонецЕсли;
	
	МестоПогрузки = КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(Объект.ДокументЭТРН, "МестоПогрузки");
	Если ЗначениеЗаполнено(МестоПогрузки) Тогда
		ЧасовойПоясПогрузки = МестоПогрузки.ЧасовойПояс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЧасовойПоясПогрузки) Тогда
		ДатаВремяПодачиПлановая = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Титул1.ДатаВремяПодачиПлановая, Неопределено, ЧасовойПоясПогрузки);
		ДатаВремяПрибытия = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Титул1.ДатаВремяПрибытия, Неопределено, ЧасовойПоясПогрузки);
		ДатаВремяУбытия = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Титул1.ДатаВремяУбытия, Неопределено, ЧасовойПоясПогрузки);
	Иначе
		ДатаВремяПодачиПлановая = Титул1.ДатаВремяПодачиПлановая;
		ДатаВремяПрибытия = Титул1.ДатаВремяПрибытия;
		ДатаВремяУбытия = Титул1.ДатаВремяУбытия;
	КонецЕсли;
	
	Элементы.ГруппаДатыИзТ1.Заголовок = ЗаголовокДатИВременПогрузки(ЧасовойПоясПогрузки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокДатИВременПогрузки(ЧасовойПояс)
	
	Заголовок = "Даты и время";
	
	Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
		Заголовок = Заголовок + " " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПредставлениеЧасовогоПоясаЛок(ЧасовойПояс);
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
